{
  "Deploy": "ปรับใช้",
  "A simple way to deploy your application to a remote location.": "วิธีง่ายๆ ในการปรับใช้แอปพลิเคชันของคุณไปยังตำแหน่งระยะไกล",
  "Manage deployments": "จัดการการทำให้ใช้งานได้",
  "Servers": "เซิร์ฟเวอร์",
  "Create Server": "สร้างเซิร์ฟเวอร์",
  "Creating Server...": "กำลังสร้างเซิร์ฟเวอร์...",
  "Return to Servers List": "กลับไปที่รายการเซิร์ฟเวอร์",
  "Manage Servers": "จัดการเซิร์ฟเวอร์",
  "Manage Server": "จัดการเซิร์ฟเวอร์",
  "Deploy sites directly to production from your development environment.": "ปรับใช้ไซต์โดยตรงกับการผลิตจากสภาพแวดล้อมการพัฒนาของคุณ",
  "To get started, click Create Server.": "ในการเริ่มต้น ให้คลิกสร้างเซิร์ฟเวอร์",
  "Paste an existing RSA private key in here or :action.": "วางคีย์ส่วนตัว RSA ที่มีอยู่ในที่นี่หรือ :action",
  "generate a new one": "สร้างใหม่",
  "Please wait...": "โปรดรอ...",
  "Server Name": "ชื่อเซิร์ฟเวอร์",
  "Production Environment": "สภาพแวดล้อมการผลิต",
  "Give this server a name.": "ตั้งชื่อเซิร์ฟเวอร์นี้",
  "Base URL": "URL ฐาน",
  "Public web address for the deployment.": "ที่อยู่เว็บสาธารณะสำหรับการปรับใช้",
  "Deployment Key": "รหัสการทำให้ใช้งานได้",
  "Grab this zip archive, extract the files and upload them to the location where the website can be reached at the Website URL specified above.": "หยิบไฟล์ zip นี้ แตกไฟล์และอัปโหลดไปยังตำแหน่งที่สามารถเข้าถึงเว็บไซต์ได้ที่ URL ของเว็บไซต์ที่ระบุด้านบน",
  "Download Beacon Files": "ดาวน์โหลดไฟล์บีคอน",
  "Check Beacon Status": "ตรวจสอบสถานะบีคอน",
  "Use this to check the Beacon status once the files have been uploaded.": "ใช้สิ่งนี้เพื่อตรวจสอบสถานะ Beacon เมื่อไฟล์ได้รับการอัปโหลดแล้ว",
  "Check Beacon": "ตรวจสอบสัญญาณ",
  "Deploy Files to Server": "ปรับใช้ไฟล์ไปยังเซิร์ฟเวอร์",
  "Transfers files from this computer to the server": "โอนไฟล์จากคอมพิวเตอร์เครื่องนี้ไปยังเซิร์ฟเวอร์",
  "Deploy to Server": "ปรับใช้กับเซิร์ฟเวอร์",
  "Install October CMS to Server": "ติดตั้ง CMS ตุลาคมไปยังเซิร์ฟเวอร์",
  "Installs a fresh copy of October CMS to the server, including the necessary configuration files.": "ติดตั้ง CMS ตุลาคมใหม่บนเซิร์ฟเวอร์ รวมถึงไฟล์การกำหนดค่าที่จำเป็น",
  "Install October CMS": "ติดตั้ง CMS ตุลาคม",
  "Run Console Script": "เรียกใช้สคริปต์คอนโซล",
  "Execute any PHP code on the server and inspect the variables": "รันโค้ด PHP บนเซิร์ฟเวอร์และตรวจสอบตัวแปร",
  "Open Console": "เปิดคอนโซล",
  "Update Environment Variables": "อัปเดตตัวแปรสภาพแวดล้อม",
  "Modify the configuration values on the server": "แก้ไขค่าการกำหนดค่าบนเซิร์ฟเวอร์",
  "Update Environment": "ปรับปรุงสภาพแวดล้อม",
  "View Deployment Key": "ดูคีย์การทำให้ใช้งานได้",
  "Display the private key used to deploy to this server": "แสดงคีย์ส่วนตัวที่ใช้ในการปรับใช้กับเซิร์ฟเวอร์นี้",
  "Show Key": "แสดงคีย์",
  "Current Version": "เวอร์ชันปัจจุบัน",
  "Active": "คล่องแคล่ว",
  "Legacy": "มรดก",
  "Ready": "พร้อม",
  "Unreachable": "ไม่สามารถเข้าถึงได้",
  "Beacon Status": "สถานะบีคอน",
  "Name": "ชื่อ",
  "URL": "URL",
  "Run": "วิ่ง",
  "Output": "เอาท์พุต",
  "Deploy Core Files": "ปรับใช้ไฟล์หลัก",
  "Includes all core modules and vendor libraries": "รวมโมดูลหลักและไลบรารีผู้ขายทั้งหมด",
  "Deploy Config Files": "ปรับใช้ไฟล์กำหนดค่า",
  "Includes everything in the config directory": "รวมทุกอย่างในไดเร็กทอรีการกำหนดค่า",
  "Deploy Plugins": "ปรับใช้ปลั๊กอิน",
  "Deploy Themes": "ปรับใช้ธีม",
  "Environment Variables": "ตัวแปรสภาพแวดล้อม",
  "Beacon is Not Found at Server": "ไม่พบบีคอนที่เซิร์ฟเวอร์",
  "Found Beacon without October CMS installed": "พบ Beacon ที่ไม่ได้ติดตั้ง CMS ตุลาคม",
  "Server is Ready to Deploy": "เซิร์ฟเวอร์พร้อมที่จะปรับใช้",
  "Danger Zone": "พื้นที่อันตราย",
  "Always Protect The Deployment Key": "ปกป้องคีย์การปรับใช้เสมอ",
  "Anyone who has the private deployment key can deploy files to this server. Make sure it is kept a secret.": "ทุกคนที่มีคีย์การปรับใช้ส่วนตัวสามารถปรับใช้ไฟล์กับเซิร์ฟเวอร์นี้ได้ ให้แน่ใจว่ามันถูกเก็บเป็นความลับ",
  "update": "อัปเดต",
  "updated": "อัพเดท",
  "Install": "ติดตั้ง",
  "Close": "ปิด I",
  "Save Config": "บันทึกการกำหนดค่า",
  "Cancel": "ยกเลิก",
  "Saving Configuration Values": "การบันทึกค่าการกำหนดค่า",
  "Finishing Up": "เสร็จสิ้น",
  "Extracting Files": "แตกไฟล์",
  "Migrating Database": "กำลังย้ายฐานข้อมูล",
  "Building :type Archive": "ตึก :type Archive",
  "Checking Database Config": "กำลังตรวจสอบการกำหนดค่าฐานข้อมูล",
  "Setting Build Number": "การตั้งค่าหมายเลขบิลด์",
  "A Legacy Version of October CMS is Detected": "ตรวจพบ CMS เวอร์ชันดั้งเดิมของเดือนตุลาคม",
  "Upgrade Configuration Files": "แปลงไฟล์กำหนดค่า",
  "Runs the artisan command to create an environment file": "รันคำสั่ง artisan เพื่อสร้างไฟล์สภาวะแวดล้อม",
  "Upgrade Config": "อัปเกรด Config",
  "Upgrading Legacy Site": "การอัพเกรดไซต์เดิม",
  "Clearing Cache": "การล้างแคช",
  "This step will set up an .env file on the server needed for deployment.": "ขั้นตอนนี้จะตั้งค่าไฟล์ .env บนเซิร์ฟเวอร์ที่จำเป็นสำหรับการทำให้ใช้งานได้",
  "Unknown": "ไม่รู้จัก",
  "Deploy App Files": "ปรับใช้ไฟล์แอป",
  "Everything in the app directory (including blueprints)": "ทุกอย่างในไดเรกทอรีแอป (รวมถึงพิมพ์เขียว)",
  "Deploy Media Files": "ปรับใช้ไฟล์มีเดีย",
  "All media files in the storage directory": "ไฟล์มีเดียทั้งหมดในไดเร็กทอรีที่เก็บข้อมูล"
}